[
    {
        "scene_number": 1,
        "dialogue": [
            {
                "character": "ANNA",
                "line": "Good afternoon, everyone. Today, I want to talk about something really important—honesty. It’s the foundation of our community."
            },
            {
                "character": "STUDENT",
                "line": "But why does honesty matter? Sometimes, it’s easier to just keep quiet."
            },
            {
                "character": "ANNA",
                "line": "Because trust builds us up. When we tell the truth, we can count on each other. That’s how we grow stronger, together."
            },
            {
                "character": "STUDENT",
                "line": "What if someone lies? Won’t that ruin everything?"
            },
            {
                "character": "ANNA",
                "line": "Lies can break trust, but honesty can rebuild it. That’s why I started the 'Truth and Trust' project—to help us all stand firm against dishonesty."
            },
            {
                "character": "MAREK",
                "line": "Excuse me, I couldn’t help but listen. A project about honesty? Sounds noble, but it"
            }
        ]
    },
    {
        "scene_number": 2,
        "dialogue": [
            {
                "character": "Marek",
                "line": "Anna, I respect what you're doing, but do you really think a few kids talking about honesty can change anything?"
            },
            {
                "character": "ANNA",
                "line": "Marek, small acts of integrity can ripple out. It's about planting seeds of change, one honest deed at a time."
            },
            {
                "character": "Marek",
                "line": "I saw a boy return a lost wallet today. Simple act, but it made me think—maybe honesty is more powerful than I believed."
            },
            {
                "character": "ANNA",
                "line": "Exactly. When we lead by example, others follow. It's the beginning of something bigger."
            }
        ]
    },
    {
        "scene_number": 3,
        "dialogue": [
            {
                "character": "ANNA",
                "line": "Marek, look at this—our town, our people, all coming together because they believe in honesty. That boy’s act, your support, it’s more powerful than you think."
            },
            {
                "character": "MAREK",
                "line": "I never imagined it could be this way. Seeing everyone stand proud, I realize honesty isn’t just a quiet virtue—it's a force that can change everything."
            },
            {
                "character": "ANNA",
                "line": "Exactly. When we act with integrity, we ignite hope in others. That’s how real change begins—one honest act at a time."
            },
            {
                "character": "MAREK",
                "line": "And I promise, I’ll keep doing my part. No matter how small, it all adds up to something bigger."
            },
            {
                "character": "ANNA",
                "line": "That’s the spirit, Marek. Together, we’re shaping a future rooted in trust and truth."
            }
        ]
    }
]